app/Controllers/Clientes.php

SELECT *
FROM `clientes`
ORDER BY `cliente_id` DESC
---
        public function cliente()
        {

            $ClientesModels = new ClientesModels();
       $data['Clientes']=$ClientesModels->orderBy ('cliente_id','DESC')->findAll();

SELECT *
FROM `clientes`
WHERE `cliente_id` = '23'
 LIMIT 1
---
    public function singleUser($id = null){
        $ClientesModels = new ClientesModels();
        $data['user_obj'] = $ClientesModels->where('cliente_id', $id)->first();